Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_layer (InputLayer)     [(None, 100)]             0         
_________________________________________________________________
embedding (Embedding)        (None, 100, 100)          40000100  
_________________________________________________________________
f (LSTM)                     (None, 100, 256)          365568    
_________________________________________________________________
lstm (LSTM)                  (None, 100, 128)          197120    
_________________________________________________________________
lstm_1 (LSTM)                (None, 64)                49408     
_________________________________________________________________
dense (Dense)                (None, 3)                 195       
=================================================================
Total params: 40,612,391
Trainable params: 612,291
Non-trainable params: 40,000,100
_________________________________________________________________